In [0]:
from google.colab import drive
drive.mount("/content/drive")

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [0]:
import os
path = '/content/drive/My Drive/'
os.chdir(path)

In [0]:
import smtplib
import time
import pandas as pd
df=pd.read_csv("data.csv")
df1=pd.read_csv("customardata.csv")
for i in range(len(df1)):
    p_name=df1["provider_name"][i]
    prof_name=df1["profession"][i]
    k=0
    for j in range(len(df["name"])):
        if df["name"][j]==p_name and prof_name==df["profession"][j] and ((df["bookingStartTimeperiod"][j]<=df1["book_start_time"][i] and df["bookingEndTimeperiod"][j]>=df1["book_start_time"][i])or(df["bookingStartTimeperiod"][j]<=df1["book_end_time"][i] and df["bookingEndTimeperiod"][j]>=df1["book_end_time"][i])):
            k=1
            break        
    if(k==0):
        print("Available..your solt  booking is in progresss....")
        
        b=pd.DataFrame([[(df["ID"][len(df)-1])+1,p_name,prof_name,df1["location"][i],df1["book_start_time"][i],df1["book_end_time"][i],df1["cust_ID"][i]]])
        b.columns=df.columns
        df=df.append(b)
        df.to_csv("data.csv",index=False)
        time.sleep(2)
        print("\nslot booked !")
        gmailaddress ="ankushbanik1234@gmail.com"
        gmailpassword = "9091203984"
        mailto1 = df1["email_id"][i]
      #  mailto2="serviceprovidergmail"
        msg = "your slot is booked "
        try:
            mailServer = smtplib.SMTP('smtp.gmail.com' , 587)
            # ...send emails
            mailServer.starttls()
            mailServer.login(gmailaddress , gmailpassword)
            mailServer.sendmail(gmailaddress, mailto1 , msg)
           # mailServer.sendmail(gmailaddress, mailto2 , msg)
            print(" \n Sent!")
            mailServer.quit()
        except:
            print( 'Something went wrong...')
       
    else:
        print("service provider is not avaiable ")

service provider is not avaiable
service provider is not avaiable
Available..your solt  booking is in progresss....

slot booked !

 Sent!

In [0]:
df

    ID    name  ... bookingEndTimeperiod customerId
0  101   sumit  ...  2019-10-02 13:25:35       2001
1  102    raja  ...  2019-08-19 14:25:35       2002
2  103   rahul  ...  2019-07-23 13:25:35       2001
3  104   sumit  ...     2019-12-12 14:05       2001
4  105  satyam  ...     2019-12-12 14:05       2001
5  106  rajesh  ...     2019-12-10 14:05       2002

[6 rows x 7 columns]

In [0]:
df1

  cust_ID    name  ... provider_name                    email_id
0    2001  ankush  ...         sumit  sharansumitkumar@gmail.com
1    2002  Rajesh  ...        rajesh   ankushbanik1234@gmail.com
0    2002  Suresh  ...          raja   ankushbanik1234@gmail.com

[3 rows x 8 columns]

In [0]:
b

      0       1                    2  ...      4     5                          6
0  2002  Suresh  2019-10-12 13:05:04  ...  Ajmer  raja  ankushbanik1234@gmail.com

[1 rows x 7 columns]

In [0]:
b=pd.DataFrame([["2002","Suresh","2019-10-12 13:05:04","2019-10-12 14:05:05","Ajmer","plumber","raja","ankushbanik1234@gmail.com"]])
b.columns=df1.columns
df1=df1.append(b)

In [0]:
df1.to_csv("customardata.csv",index=False)